export interface IQuestion {
  question: string
  list?: string[]
}

export const questions: IQuestion[] = [
  {
    question: 'น้องคาดหวังอะไรจากค่าย Comcamp',
  },
  {
    question:
      'หากน้องมีความคิดที่จะทำโปรเจกต์ “VRWellnessHub ศูนย์บริการสุขภาพจิตแบบเสมือนจริง” ซึ่งจะช่วยให้ทุกคนสามารถเข้ารับบริการศูนย์บริการสุขภาพจิตได้ทุกที่ผ่านเทคโนโลยี VR โดยที่น้องต้องนำไป pitching ให้กับนักลงทุนกลุ่มหนึ่ง เพื่อที่จะหาเงินทุนในการทำโปรเจกต์ น้องจะนำเสนอโปรเจกต์นี้ภายในเวลา 2 นาทีว่าอย่างไร',
  },
  {
    question:
      'หากน้องได้รับมอบหมายให้ทำโปรเจกต์ภายในค่าย และได้รับสิทธิ์ให้เป็นคนเลือกสมาชิกในกลุ่มเอง น้องจะมีวิธีเลือกคนเข้ามาในกลุ่มอย่างไร พร้อมอธิบายเหตุผล (สมาชิกกลุ่มมี 5 คนรวมน้องด้วย) และหากเพื่อนคนหนึ่งที่น้องเลือกมาเข้าร่วมกลุ่มจริง ๆ แล้วเป็นคนที่มีนิสัยเห็นแก่ตัว ไม่ยอมช่วยเพื่อนไม่รับฟังความคิดเห็นของใครเลย และเอาความคิดตนเองเป็นศูนย์กลาง น้องจะจัดการกับปัญหานี้อย่างไร',
  },
  {
    question:
      'ขณะที่น้องกำลังทานมื้อค่ำสุดหรูอยู่บนเรือยอร์ชกลางทะเล จู่ ๆ ก็เกิดเหตุการณ์ไม่คาดฝันขึ้นคลื่นลมพัดแรงจนเรืออับปาง น้องลืมตาตื่นมาพบว่าตนเองติดอยู่บนเกาะร้างหน้าตาประหลาดแห่งหนึ่งโดยที่ทั้งเกาะมีต้นมะพร้าวอยู่เพียง 3 ต้น ซึ่งทุก ๆ 7 วันจะออกผล 1 ลูก มีภูเขาหินสูง 5 เมตรอยู่บริเวณกลางเกาะ และมี “แพนเซียส” มอนสเตอร์ที่มีหน้าตาคล้ายเสือชีต้าร์ มีนิสัยดุร้าย และกินเนื้อเป็นอาหารอยู่บนเกาะ 1 ตัว ทุก ๆ 10 วันระดับน้ำรอบ ๆ เกาะจะสูงขึ้น ซึ่งระดับน้ำจะลงก็ต่อเมื่อเป็นวันถัดไปในขณะที่น้ำขึ้นจะมี “ทิบารอน” มอนสเตอร์ที่อันตรายที่สุดในท้องทะเลมารวมกันที่เกาะเพื่อล่าเหยื่อซึ่งวิธีเอาตัวรอดจากทิบารอน คือ ต้องปีนขึ้นไปบนภูเขาหินเท่านั้น ซึ่งแพนเซียสก็จะปีนขึ้นมาเช่นกันน้องต้องหาวิธีอยู่รอดให้ได้ 30 วัน แล้วจึงจะมีเรือกู้ภัยมาช่วยเหลือ หากเลือกได้น้องจะเลือกอะไรติดตัวไปด้วย3 อย่าง พร้อมบอกแนวทางการเอาชีวิตรอดบนเกาะ',
    list: [
      'บันไดสูงห้าเมตร 1 อัน',
      'มีดปอกมะพร้าว 1 เล่ม',
      'หมูตัวผู้1 ตัว',
      'ยากันยุง 1 ขวด',
      'ไฟแช็ค 1 อัน',
      'ไม้ขีดไฟพร้อมกล่อง มีไม้ขีดไฟ 9 ก้าน',
      'หอก 1 เล่ม',
      'ขวาน 1 เล่ม',
      'สเปรย์พ่นสี สีเหลือง 1 กระป๋อง',
      'หมวกกันน็อค 1 ใบ',
      'ห่วงยาง 1 ห่วง',
      'นกหวีด 1 ตัว',
    ],
  },
  {
    question:
      'A, B และ C มีใครคนใดคนหนึ่งที่ไม่ได้เป็นนักฝึกมอนสเตอร์ตัวจริง แต่ไม่มีใครยอมรับสารภาพและทุกคนอ้างว่าตนเองคือนักฝึกมอนสเตอร์โดย A พูดว่า "B นั่นแหละที่ไม่ได้เป็นนักฝึกมอนสเตอร์!"ถ้าในที่นี้คนที่ไม่ได้เป็นนักฝึกมอนสเตอร์เป็นคนเดียวที่พูดความจริง ใครคือคนที่ไม่ได้เป็นนักฝึกมอนสเตอร์ตัวจริงและเพราะอะไร',
  },
  {
    question:
      'ถ้าน้องได้รับมอบหมายให้สร้าง "มอนสเตอร์พกพา" หนึ่งชนิด เพื่อเตรียมรับมือกับปัญหาอุทกภัยระดับประเทศ โดยจะสามารถใส่เทคโนโลยี 1 อย่างเป็นความสามารถพิเศษได้ น้องจะเลือกใส่เทคโนโลยีอะไร เพราะอะไร พร้อมอธิบายหลักการทำงานของมอนเตอร์พกพาและเทคโนโลยี(มอนสเตอร์พกพา คือ มอนสเตอร์ที่สามารถพกติดตัวไปไหนก็ได้ โดยจะมีความสามารถพิเศษเฉพาะตัวอยู่1 อย่าง)',
  },
]
