import React from 'react'

const About: React.FC = () => {
  return (
    <div>
      <h2>What Is Comcamp</h2>
      <p>
        โครงการฝึกอบรมเชิงปฏิบัติการคอมพิวเตอร์ หรือ “ComCamp” คือค่ายที่ทางภาควิชาวิศวกรรมคอมพิวเตอร์
        มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรีได้จัดขึ้น โดยภายในค่ายจะมีทั้งการแนะแนวการศึกษาต่อและกิจกรรมต่าง ๆ
        เพื่อให้น้อง ๆ ได้เข้ามารู้จักกับภาควิชาวิศวกรรมคอมพิวเตอร์มากขึ้น ซึ่งจะทำให้น้อง ๆ ได้รับความรู้และแรงบันดาลใจ
        พร้อมกับความสนุกสนานจากกิจกรรมสันทนาการสุดพิเศษจากพี่ ๆ CPE อีกด้วย
      </p>
      <br></br>
    </div>
  )
}

export default About
