import React from 'react'

const CampHighlight: React.FC = () => {
  return (
    <div>
      <h2>• Highlight</h2>
      <h3>- กิจกรรมสันทนาการ</h3>
      <p>
        - ภายในค่ายจะมีกิจกรรมสุดพิเศษจากรุ่นพี่ เพื่อสร้างความใกล้ชิดและกระชับความสัมพันธ์ระหว่างเพื่อน ๆ พี่ ๆ
        ภายในค่ายให้ใกล้ชิดกันมากยิ่งขึ้น
        <br></br> - น้อง ๆ จะได้พูดคุยทำความรู้จักกับเพื่อนใหม่ในที่มีความสนใจในด้านคอมพิวเตอร์
        เพื่อสานสัมพันธ์กับเพื่อน ๆ ที่อยากเป็นชาววิศวะคอมด้วยกัน
      </p>
      <br></br>

      <h3>- สิ่งสำคัญสำหรับน้อง ๆ ที่เข้าร่วมจะได้รับ</h3>
      <p>
        - ได้แลกเปลี่ยนประสบการณ์และทำความรู้จักกับพี่ ๆ วิศวะคอมบางมด
        <br></br>- เรียนรู้สิ่งต่าง ๆ เสมือนเป็นส่วนหนึ่งของภาควิชาวิศวกรรมคอมพิวเตอร์
        <br></br>- ความรู้พื้นฐานสำหรับนำไปต่อยอดเป็นผลงานที่ใช้งานได้จริง
        <br></br>- ตลอดระยะเวลาของค่าย น้อง ๆ จะได้ทำความคุ้นชินกับสภาพแวดล้อมของภาควิชาวิศวกรรมคอมพิวเตอร์
        เพื่อเตรียมพร้อมสำหรับการเป็นครอบครัวในรั้วมหาลัยในฝันของน้อง ๆ
      </p>
      <br></br>

      <h3>- เนื้อหาสุดพิเศษสำหรับน้อง ๆ ที่เข้าร่วมกิจกรรม</h3>
      <h4>💻 เริ่มต้นกับการเขียนโปรแกรมด้วยภาษา C (C Programming)</h4>
      <p>
        - เริ่มต้นไปด้วยกันกับการเขียนโปรเเกรมด้วยภาษาซีที่จะทำให้น้อง ๆ สร้างสรรค์โลกของน้อง ๆ ได้มากขึ้น
        นอกจากนี้ยังมีการใช้ Flowchart ที่จะทำให้เข้าใจการเขียนโปรแกรมมากขึ้น บอกเลยว่า
        “แม้ไม่มีพื้นฐานก็สามารถเข้าใจได้ง่าย ๆ”
      </p>
      <br></br>

      <h4>🧑‍💻 ก้าวเข้าสู่การพัฒนาเว็บไซต์ (Web development)</h4>
      <p>
        - อยากสร้างเว็บไซต์เป็นแต่ไม่รู้ควรเริ่มตรงไหนดี มาทำความรู้จักไปพร้อมกันกับเครื่องมือยอดฮิตอย่าง React และ
        Tailwind CSS แม้ว่า เริ่มต้นจากศูนย์ก็สามารถมีเว็บไซต์เป็นของตัวเองได้ง่าย ๆ นอกจากนี้ยังมีการสอนการทำงานกับ API
        ที่จะทำให้เว็บไซต์ของน้อง ๆ มีประสิทธิภาพให้ดียิ่งขึ้น
      </p>
      <br></br>

      <h4>📈ทำความรู้จักกับภาษาไพทอนและการนำเสนอภาพข้อมูล (Introduction and Data Visualization in Python)</h4>
      <p>
        - มาเรียนรู้การจัดการและวิเคราะห์ข้อมูลไปด้วยกันกับภาษา Python อีกหนึ่งภาษาที่เป็นเครื่องมือยอดนิยม ตอบรับกระแส
        Data Analysis ที่กำลังมาแรงในขณะนี้
      </p>
      <br></br>

      <h4>🎨 มารู้จักกับการออกแบบเว็บไซต์ (UI Design)</h4>
      <p>- เรียนรู้ไปพร้อมกันกับศิลปะแห่งการออกแบบ UI ให้สวยงามและมีประสิทธิภาพ ด้วยเครื่องมือยอดนิยมอย่าง Figma</p>
      <br></br>

      <h4>📑 การทำโปรเจคต์สุดท้าทายเพื่อพิชิตภารกิจกอบกู้โลก</h4>
      <p>
        - ภารกิจมินิโปรเจคต์สุดท้าทายที่มาจากปัญหาในชีวิตจริง ซึ่งจะทำให้น้อง ๆ ฝึกการทำงานเป็นทีมเวิร์ค
        อีกทั้งยังสามารถนำไปต่อยอดเป็นสุดยอดโปรเจคต์ได้ในอนาคต
      </p>
      <br></br>
    </div>
  )
}

export default CampHighlight
