import React from 'react'

const Condition: React.FC = () => {
  return (
    <div>
      <h2>เกณฑ์การรับสมัคร</h2>
      <p>
        - น้อง ๆ ที่กำลังศึกษาอยู่ชั้นมัธยมศึกษาปีที่ 4 - 5 หรือเทียบเท่า (GPAX 3.00 ขึ้นไป)
        <br></br>- มีความสนใจในด้านคอมพิวเตอร์และภาควิชาวิศวกรรมคอมพิวเตอร์ โดยไม่จำเป็นต้องมีพื้นฐานการเขียนโปรแกรม
        <br></br>- สามารถเข้าพักได้ในระยะเวลาและสถานที่ที่กำหนดตลอดโครงการ
        <br></br>- ผู้ปกครองอนุญาตและยินยอมให้นักเรียนเข้าร่วมโครงการ
        <br></br>- คุณสมบัติเพิ่มเติม : ม.ปลาย ศึกษาเกี่ยวกับสายวิทยาศาสตร์ คณิตศาสตร์ และ คอมพิวเตอร์ (หรือสายอื่น ๆ
        ที่ เกี่ยวข้องกับ คอมพิวเตอร์และเทคโนโลยี) หรือ ปวช. ในสาขาคอมพิวเตอร์ธุรกิจ, สาขาช่างไฟฟ้ากำลัง
        (อิเล็กทรอนิกส์), สาขาเมคคาทรอนิกส์ และหุ่นยนต์ (หรือสายอื่น ๆ ที่เกี่ยวข้องกับคอมพิวเตอร์และเทคโนโลยี)
      </p>
      <br></br>
    </div>
  )
}

export default Condition
