import React from 'react'

const Faq: React.FC = () => {
  return (
    <div>
      <h2>• FAQ คำถามที่พบบ่อย</h2>
      <p>
        - ค่ายเปิดรับสมัครถึงวันไหนคะ
        <br></br>== ค่ายเปิดรับสมัครตั้งแต่วันที่ 1 - 10 มีนาคม 2567 ค่ะ
        <br></br>
        <br></br>-ถ้าไม่มีพื้นฐานทางด้านคอมพิวเตอร์ สามารถสมัครได้ไหมครับ
        <br></br>== เพียงแค่มีความสนใจทางด้านคอมพิวเตอร์ ไม่จำเป็นต้องมีพื้นฐานมาก่อนก็สามารถเข้าได้ค่ะ
      </p>
      {/* มีเยอะกว่านี้มากแต่ยังไม่ได้ใส่ */}
      <br></br>
    </div>
  )
}

export default Faq
