import React from 'react'

const Invitation: React.FC = () => {
  return (
    <div>
      <h2>คำโปรยกิจกรรม</h2>
      <p>
        ขอเชิญชวนน้อง ๆ ที่มีความสนใจในด้านคอมพิวเตอร์มาเข้าร่วมการผจญภัยไปกับ ComCamp ครั้งที่ 35 ที่จะพาน้อง ๆ
        ผู้มีพรสวรรค์ที่ซ่อนเร้นอยู่ไปทำภารกิจและผจญภัยไปพร้อมกับเพื่อน ๆ และ พี่ ๆ CPE
        นอกจากนี้ยังจะได้ทำความรู้จักกับภาควิชาวิศวกรรมคอมพิวเตอร์ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี รวมถึงพาน้อง ๆ
        ไปสัมผัสความเป็นนักศึกษาวิศวะคอมฯ ที่ไม่มีใครเคยรู้มาก่อน ✨ แต่เดี๋ยว ! ไม่ได้มีแค่นี้นะ ยังมีเพื่อน ๆ
        มอนสเตอร์คู่หูตัวน้อยที่จะฟันฝ่าอุปสรรคภายในค่ายไปพร้อมกันกับน้อง ๆ และรอคอยที่จะได้รู้จักกับน้อง ๆ อยู่
        พวกเขาเป็นใคร !? แล้วมาร่วมหาคำตอบได้ใน ComCamp ครั้งที่ 35
      </p>
      <br></br>
    </div>
  )
}

export default Invitation
